ALTER TABLE `merchant`.`admin_permission`
    ADD COLUMN `menu_id` bigint(20) NULL DEFAULT 0 COMMENT '菜单ID' AFTER `pid`;


truncate table `merchant`.`admin_permission`;
INSERT INTO `merchant`.`admin_permission` (`id`, `alias`, `create_time`, `name`, `pid`, `menu_id`)
VALUES (1, '首页', '2020-07-04 20:57:08', 'home', 0, 1),
       (2, '账户中心', '2020-07-04 20:57:08', 'account', 0, 2),
       (3, '基本资料管理', '2020-07-04 20:58:22', 'basic', 2, 3),
       (4, '二级商户管理', '2020-07-04 20:58:22', 'secondary', 2, 4),
       (5, '我的证书', '2020-07-04 20:59:31', 'mykey', 2, 5),
       (6, '投注用户管理', '2020-07-04 20:59:31', 'betting', 2, 6),
       (7, '授权中心', '2020-07-04 21:00:34', 'auth', 0, 7),
       (8, '用户管理', '2020-07-04 21:00:34', 'user', 7, 8),
       (9, '角色管理', '2020-07-04 21:01:39', 'role', 7, 9),
       (10, '财务中心', '2020-07-04 21:01:39', 'finance', 0, 10),
       (11, '电子账单', '2020-07-04 21:05:13', 'liquidation', 10, 11),
       (12, '对账单', '2020-07-04 21:05:13', 'statements', 10, 12),
       (13, '数据中心', '2020-07-04 21:07:18', 'data_center', 0, 13),
       (14, '注单投注查询', '2020-07-04 21:06:11', 'bet_slip', 13, 14),
       (15, '商户注单统计', '2020-07-04 21:07:32', 'merchant_note', 13, 15),
       (16, '用户投注统计', '2020-07-04 21:07:32', 'users', 13, 16),
       (17, '消息中心', '2020-07-04 21:11:40', 'message_center', 0, 17),
       (18, '公告栏', '2020-07-04 21:11:40', 'bulletin', 17, 18),
       (19, '我的消息', '2020-07-04 21:12:55', 'mymessage', 17, 19),
       (23, '赛事投注统计', '2020-07-04 21:12:55', 'match_bonus', 13, 23);

